_out/iam/inline_role.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Role with Inline Policy </title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Role with Inline Policy </h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgea5a9b1">Parameters</a>
<ul>
<li><a href="#orgdc08752">DeploymentName</a></li>
</ul>
</li>
<li><a href="#org0ba2849">Resources</a>
<ul>
<li><a href="#org92b06c7">Role</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">AWSTemplateFormatVersion</span>: 2010-09-09
<span style="color: #dcaeea;">Description</span>: An IAM Role with an inline policy
</pre>
</div>

<div id="outline-container-orgea5a9b1" class="outline-2">
<h2 id="orgea5a9b1"><a href="#orgea5a9b1">Parameters</a></h2>
<div class="outline-text-2" id="text-orgea5a9b1">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">Parameters</span>:
</pre>
</div>

<table id="orgf457a66">


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Param</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">DeploymentName</td>
<td class="org-left">cfc</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgdc08752" class="outline-3">
<h3 id="orgdc08752"><a href="#orgdc08752">DeploymentName</a></h3>
<div class="outline-text-3" id="text-orgdc08752">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">DeploymentName</span>:
    <span style="color: #dcaeea;">Type</span>: String
    <span style="color: #dcaeea;">Description</span>: A name for this deployment
</pre>
</div>

<p>
A <b>deployment</b> is a deployed application, potentially comprised of many
CloudFormation stacks. This is sometimes called an "environment", but that is an
overloaded and confusing term. Use the <code>DeploymentName</code> to indicate which
logical deployment a stack belongs to.
</p>

<p>
If a deployment is completely specified by exactly one CloudFormation template,
the <code>DeploymentName</code> and the <a href="https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/pseudo-parameter-reference.html#cfn-pseudo-param-stackname">AWS::StackName</a> would refer to the same things. In
that case, consider not using a <code>DeploymentName</code> parameter.
</p>
</div>
</div>
</div>

<div id="outline-container-org0ba2849" class="outline-2">
<h2 id="org0ba2849"><a href="#org0ba2849">Resources</a></h2>
<div class="outline-text-2" id="text-org0ba2849">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">Resources</span>:
</pre>
</div>
</div>

<div id="outline-container-org92b06c7" class="outline-3">
<h3 id="org92b06c7"><a href="#org92b06c7">Role</a></h3>
<div class="outline-text-3" id="text-org92b06c7">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">Role</span>:
    <span style="color: #dcaeea;">Type</span>: AWS::IAM::Role
    <span style="color: #dcaeea;">Properties</span>:
      <span style="color: #dcaeea;">RoleName</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-Role"</span>
      <span style="color: #dcaeea;">Description</span>: Allows EC2 instances to call AWS services
      <span style="color: #dcaeea;">AssumeRolePolicyDocument</span>:
        <span style="color: #dcaeea;">Version</span>: 2012-10-17
        <span style="color: #dcaeea;">Statement</span>:
          - <span style="color: #dcaeea;">Effect</span>: Allow
            <span style="color: #dcaeea;">Principal</span>:
              <span style="color: #dcaeea;">Service</span>: ec2.amazonaws.com
            <span style="color: #dcaeea;">Action</span>:
              - sts:AssumeRole
      <span style="color: #dcaeea;">Policies</span>:
        - <span style="color: #dcaeea;">PolicyName</span>: InstancePolicy
          <span style="color: #dcaeea;">PolicyDocument</span>:
            <span style="color: #dcaeea;">Version</span>: 2012-10-17
            <span style="color: #dcaeea;">Statement</span>:
              - <span style="color: #dcaeea;">Effect</span>: Allow
                <span style="color: #dcaeea;">Action</span>:
                  - logs:CreateLogGroup
                  - logs:CreateLogStream
                  - logs:PutLogEvents
                  - logs:DescribeLogStreams
                  - cloudformation:DescribeStackResource
                <span style="color: #dcaeea;">Resource</span>: <span style="color: #98be65;">"*"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
